app/Http/ViewComposers/EmploymentCategoryComposer.php

select * from `employment_categories`
---
    public function compose($view)
    {
        $categories = EmploymentCategory::all();