app/Http/Controllers/CandidatureController.php

    public function store(Request $request)
    {
        $user = \Auth::user();
        $jobOffer = JobOffer::find($request->jobOfferId);


        if($jobOffer !== null && $jobOffer->getOriginal('status') === JobOffer::ACTIVE){
            $candidature = new Candidature();
            $candidature->job_offers_id = $jobOffer->id;
            $candidature->user_id = $user->id;


            $candidature->save();
---
insert into `candidatures` (`job_offers_id`, `user_id`, `updated_at`, `created_at`) values (1, 2, '2020-01-10 15:20:29', '2020-01-10 15:20:29')