app/Http/Controllers/EmploymentCategoryController.php

    public function index()
    {

        $categories = EmploymentCategory::latest()->paginate(5);
---
select * from `employment_categories` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `employment_categories`