app/Http/Controllers/HomeController.php

    public function index()
    {
        $jobOffers=JobOffer::where('status', 'active')
            ->orderBy('created_at', 'desc')
            ->paginate(5);
---
select * from `job_offers` where `status` = 'active' order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `job_offers` where `status` = 'active'

    public function searchCategory($category){
        $categorySelected = EmploymentCategory::where('slug',$category)->first();
        $jobOffers = JobOffer::whereHas('employmentCategories', function($query) use($categorySelected){
            $query->where('categories_job.employment_categories_id','=', $categorySelected->id);
        })->latest()->paginate(5);
---
select * from `employment_categories` where `slug` = 'recursoshumanos' limit 1
select count(*) as aggregate from `job_offers` where exists (select * from `employment_categories` inner join `categories_job` on `employment_categories`.`id` = `categories_job`.`employment_categories_id` where `job_offers`.`id` = `categories_job`.`job_offers_id` and `categories_job`.`employment_categories_id` = 4)

    public function search(Request $request){

        $query = JobOffer::query();

        if ($request->has('name')) {
            $query->where('name', $request->name)->orWhere('name', 'like', '%' . $request->name . '%');
        }

        if ($request->has('categories')) {
            $categories = EmploymentCategory::where('id', $request->categories)->first();
            if(!is_null($categories)) {
                $query->whereHas('employmentCategories', function ($query) use ($categories) {
                    $query->where('categories_job.employment_categories_id', '=', $categories->id);
                });
---
select * from `employment_categories` where `id` = 'all' limit 1