app/Http/Controllers/JobOfferController.php

    public function index()
    {
        $jobOffers = JobOffer::with('candidatures')->latest()->paginate(5);
---
select * from `candidatures` where `candidatures`.`job_offers_id` in (1, 2, 3, 4, 5)
select * from `job_offers` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `job_offers`

    public function create()
    {
        $categories = EmploymentCategory::all();
---
select * from `employment_categories`

    public function edit($id)
    {
        $jobOffer=JobOffer::with('employmentCategories')->find($id);
        $categories = EmploymentCategory::all();
---
select * from `job_offers` where `job_offers`.`id` = '4' limit 1
select * from `employment_categories`

    public function show($id)
    {
        $user = \Auth::user();
            $jobOffer = JobOffer::with('candidatures')->findOrFail($id);
            $candidature = null;
            if($user) {
                $matchThese = ['user_id' => $user->id, 'job_offers_id' => $jobOffer->id];
                $candidature = Candidature::where($matchThese)->first();;
---
select * from `job_offers` where `job_offers`.`id` = '1' limit 1
select * from `candidatures` where (`user_id` = 2 and `job_offers_id` = 1) limit 1

    public function manage(Request $request, $id){
        $job_offer = JobOffer::where('id',$id)->firstOrFail();
        $candidates = Candidature::has('user')->with('user')->where('job_offers_id',$id)->latest()->paginate(10);
---
select * from `job_offers` where `id` = '4' limit 1
select * from `candidatures` where exists (select * from `users` where `candidatures`.`user_id` = `users`.`id`) and `job_offers_id` = '4' order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (2, 3, 4)
select count(*) as aggregate from `candidatures` where exists (select * from `users` where `candidatures`.`user_id` = `users`.`id`) and `job_offers_id` = '4'