app/Http/Controllers/UserController.php

select * from `candidatures` where `user_id` = 2 order by `created_at` desc limit 5 offset 0
select * from `job_offers` where `job_offers`.`id` in (1, 4, 5)
select count(*) as aggregate from `candidatures` where `user_id` = 2
---
    public function show()
    {

        $user = \Auth::user();
        $candidatures = Candidature::where('user_id',\Auth::user()->id)->with('jobOffer')->latest()->paginate(5);